#!/usr/bin/env python
# -*- coding: utf-8 -*-
import rospy
import random

from flexbe_core import EventState, Logger

    #################################
    # SRG Stefan: Modified by SRG 11.3.2019
    # From: https://github.com/FlexBE/flexbe_strands/blob/master/strands_flexbe_states/src/strands_flexbe_states/pick_joke_state.py
    #################################

class PickRobotJokeState(EventState):
	'''
	Select a joke or pick a random one.
	#> robot_joke_OUT 		string 	Provides the selected joke.
	<= done 			Joke has been selected.
	'''

	RANDOM = 0

	def __init__(self):
		super(PickRobotJokeState, self).__init__(outcomes = ['done'],
											output_keys = ['robot_joke_OUT'])

		
		self._robot_joke_OUT = None
		self._joke_selection = 0
		self._jokes = [	'Какво ще се получи ако кръстосате робот с трактор? Транс-фермер! Хаа, хаа, хаа.',
'Колко робота са необходими за да се завие крушка? Три, един, който да държи крушката и два за да въртят стълбата! Хаа, хаа, хаа.',
'Каква е любимата музика на роботите? Хеви метъл! Хаа, хаа, хаа.',
'Защо роботите често са ядосани? Защото хората постоянно им натискат копчетата. Хаа, хаа, хаа.',
'Кога робот би отишъл на доктор? Когато хване вирус! Хаа, хаа, хаа.',
# 'Какво става с робота когато падне в кална локва? Ами става мокър и кален. Хаа, хаа, хаа.',
'Влиза робот в бара, поръчва си питие. Бармана казва: Хей, не сервираме на роботи. Робота отговаря: Е, все някой ден ще започнете да сервирате и на нас. Хаа, хаа, хаа.',
'Защо роботите са срамежливи? Защото имат софтуер и хардуер, но нямат гащи. Хаа, хаа, хаа.',
'Господине, какво правите? Това е машинно масло, не го пиите! Аз съм Робокоп бе! Хаа. Хаа. Хаа.',
'Все някога ще създадем съвършенни роботи.Те ще ни спасят, от всичката тежка физическа и умствена работа. А ние ще им сервираме кафето. Хаа. Хаа. Хаа.',
'Шефът. Петров, решихме да те заменим с този робот. Не, защо?. Той какво може да прави? Нищо... Хаа. Хаа. Хаа.',
'Майка вика, до 20 години щял да ме замени робот в моята работа. Викам ѝ, да дойде още утре в 8 часа, няма какво да чакаме цели двадесет години. Хаа. Хаа. Хаа.']



	def execute(self, userdata):
		userdata.robot_joke_OUT = self._jokes[self._joke_selection - 1]
		# Logger.loginfo('The joke selected is:  \n%s' % userdata.robot_joke_OUT)
		# Logger.logwarn('Failed to send the speech command:\n%s' % str(userdata.robot_joke_OUT))
		Logger.logwarn('PickRobotJokeState on_execute')
		return 'done'
		

	def on_enter(self, userdata):
		if self._joke_selection == 0:
			self._joke_selection = random.randint(1, len(self._jokes))
			Logger.logwarn('PickRobotJokeState on_enter')

# 'Какво ще се получи ако кръстосате робот с трактор? Транс-фермер! Ха, ха, ха.',


##### неподходящи за пред публика????
# 'В БАН създали робот полицай. Учените се удивили много, когато на третия дез започнал да взима рушвети. Хаа. Хаа. Хаа.'
# 'Каква е разликата между роботите и диригентите? Роботите понякога се държат наистина човешки. Хаа. Хаа. Хаа.'
# 'В Корея създали куче-робот и случайно го изяли. Хаа. Хаа. Хаа.'
# 'Мама-робот казва на дъщеря си. Нека първо да се ожени за теб! И преди сватбата не му показвай схемата си! Хаа. Хаа. Хаа.'
# 'В Япония изобретяват робот за залавяне на крадци. В Япония за 5 минути за хванати 100 крадеца, в САЩ за същото време са заловени 200 крадци, а във България за 5 минути открадват робота! Хаа. Хаа. Хаа.'
		